[
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1QUcwMDM5LTAwMDkxMA",
    "title_en": "Ministers’ statement on introduction of federal hate crime legislation",
    "summary_en": "Niki Sharma, Attorney General, and Nina Krieger, Minister of Public Safety and Solicitor General, have released the following statement in response to the introduction of new proposed Criminal Code amendments by the federal government: ",
    "url": "https://news.gov.bc.ca/releases/2025AG0039-000910",
    "hero_img": "https://images.unsplash.com/photo-1724440550628-84d3fd9f076d?ixid=M3w4MDYzNzl8MHwxfHNlYXJjaHwxfHxNaW5pc3RlcnMlRTIlODAlOTklMjBpbnRyb2R1Y3Rpb24lMjBmZWRlcmFsJTIwQnJpdGlzaCUyMENvbHVtYmlhfGVufDF8MHx8fDE3NTgzMjIyNjJ8MA&ixlib=rb-4.1.0&w=1600&h=900&q=80&auto=format&fit=crop",
    "published_at": "2025-09-16T08:00:00.000Z",
    "content_en": "Niki Sharma, Attorney General, and Nina Krieger, Minister of Public Safety and Solicitor General, have released the following statement in response to the introduction of new proposed Criminal Code amendments by the federal government:\n\n“We welcome today’s federal legislation creating new Criminal Code offences targeting hate crimes. Our government has long called for stronger tools to help law enforcement act against hate and to better protect people in their places of worship, cultural centres and community spaces. These new offences will also give police and prosecutors clearer legal pathways to pursue hate-motivated cases, helping to ensure accountability for those who spread hate and cause harm. We are encouraged that the federal government has heard and responded to our advocacy.\n\n“Here in B.C., police-reported hate crimes rose by 23% from 2022 to 2023. Incidents motivated by race or ethnicity increased by 12%, those targeting religion surged by more than 50% and hate crimes related to sexual orientation jumped by 43%. Addressing this disturbing rise in hate crimes is a top priority for our government. We are the only province to have a dedicated Integrated Hate Crimes Unit within the RCMP and have invested in initiatives like the Racist Incident Helpline, Anti-Hate Community Support Fund, and through federal contributions, the Shift B.C. program, which focuses on preventing radicalized violence by offering support to individuals at risk.\n\n“This new federal legislation provides another important tool to strengthen our response and continue that vital work. We look forward to continuing to work closely with the federal government to ensure local law enforcement have the tools they need to combat hate in our communities.\n\n“At the same time, there is still much more to do. We continue to urge the federal government to bring forward further amendments to strengthen the Criminal Code, including improvements to bail laws, stronger penalties for repeat violent offenders and better protections for survivors of intimate-partner violence. Ottawa has indicated its intent to act on these areas, and we look forward to seeing those commitments reflected in future legislation this fall.”\n\n“Everyone deserves to feel safe in their communities and we will continue working across government and alongside our community partners to build systemic, long-term solutions to address the complex issues that allow hate to take root.”"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1SU5GMDA0Ny0wMDA5MDg",
    "title_en": "New Prince Rupert emergency department opens for patients",
    "summary_en": "A bigger and better emergency department at Prince Rupert Regional Hospital is open so more patients can receive greater access to emergency care.   ",
    "url": "https://news.gov.bc.ca/releases/2025INF0047-000908",
    "hero_img": "https://live.staticflickr.com/65535/54798912983_a81343ec26_b.jpg",
    "published_at": "2025-09-16T12:30:00.000Z",
    "content_en": "A bigger and better emergency department at Prince Rupert Regional Hospital is open so more patients can receive greater access to emergency care.\n\n“This state-of-the-art emergency department is a major step forward in delivering high-quality emergency care and creating better working conditions for staff,” said Bowinn Ma, Minister of Infrastructure. “With expanded trauma and triage areas and design improvements that support patient flow and privacy, we’re investing in the health-care facilities that communities need.”\n\nThe modernized emergency department will improve patient care and help attract and retain health-care professionals in the region. Upgrades include:\n\nA new registration area and main lobby will improve patient flow in a modern environment.\n\nA larger triage and trauma area will provide a bigger patient assessment and treatment area.\n\nImproved high acuity unit rooms provide enhanced infection prevention-control measures and better patient privacy.\n\nFunding for the upgraded emergency department includes $9.9 million from the Province and $6.6 from the Northwest Regional Hospital District. The joint $16.5-million investment reflects a unified approach to meeting the community’s growing need for high-quality, accessible emergency services.\n\nThe Prince Rupert Regional Hospital is located on the territory of the Tsimshian First Nation. Northern Health worked with the local First Nation throughout the project to ensure the newly renewed emergency department is welcoming and culturally safe. The hospital serves as the primary health-care facility for more than 30,000 residents in the north coast, including surrounding municipalities and many remote and First Nations communities. It provides essential services such as 24/7 emergency care, in-patient treatment, surgical procedures, medical imaging and laboratory diagnostics, and is often the first point of contact for critical and urgent medical situations.\n\n“Everyone deserves timely health care close to home and delivering that for people across the province is one of our top priorities, which is why I’m so thrilled the new Prince Rupert emergency department is now open,” said Josie Osborne, Minister of Health “Patients deserve high-quality care in modern surroundings and health-care workers should have access to the latest life-saving technology, and this new emergency department will provide people in Prince Rupert and area with greater access to these services.”\n\nThe upgrades to the emergency department at Prince Rupert Regional Hospital are part of government’s work to improve and expand access to health-care infrastructure in communities throughout B.C.\n\nDebra Toporowski, parliamentary secretary for rural health —\n\n“Every family deserves access to quality emergency care, no matter where they live. With this significant redevelopment in Prince Rupert, we are taking concrete action to reduce wait times and provide compassionate, modern care to the dedicated people of the north coast. This is how we build a healthier, more resilient future for all of B.C.”\n\nTamara Davidson, MLA for North Coast-Haida Gwaii —\n\n“Emergency care is essential for families in our region, providing life-saving treatment when it’s needed most, close to home. The new emergency department will improve access to critical health services, ensure residents receive the high-quality care they deserve and attract new doctors and health-care staff to the area. This investment will make a real difference in the lives of people throughout our community.”\n\nColleen Nyce, board chair, Northern Health —\n\n“I am so pleased to be able to welcome staff, physicians and patients into this new and improved emergency department. This new space will help to ensure that those living in Prince Rupert have access to high-quality care in a new, state-of-the-art department.”\n\nBarry Pages, chair, North West Regional Hospital District —\n\n“The North West Regional Hospital District supports the investment of a new, modern emergency department at the Prince Rupert Hospital to ensure that residents of the north coast get the best services possible and that the working conditions for employees of the hospital are safe and modern.”\n\nQuick Facts:\n\nThe emergency department at the Prince Rupert hospital serves an average of 43 patients a day with approximately 16,000 visits per year.\n\nPrince Rupert Regional Hospital opened in 1971 and serves the communities of Prince Rupert, Port Edward, four coastal Tsimshian communities and Haida Gwaii.\n\nLearn More:\n\nTo read more about services at Prince Rupert Regional Hospital, visit: https://www.northernhealth.ca/our-communities/prince-rupert/health-services-at-a-glance\n\nTo read more about Northern Health, visit: https://www.northernhealth.ca/"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1SU5GMDAzOS0wMDA4OTU",
    "title_en": "On-campus student housing opens at North Island College",
    "summary_en": "North Island College’s first on-campus student housing complex is now open for students.",
    "url": "https://news.gov.bc.ca/releases/2025INF0039-000895",
    "hero_img": "https://live.staticflickr.com/65535/54796451874_0695a732e5_b.jpg",
    "published_at": "2025-09-16T12:30:00.000Z",
    "content_en": "North Island College’s first on-campus student housing complex is now open for students.\n\n“Students of all ages will benefit from North Island College’s first student housing project,” said Bowinn Ma, Minister of Infrastructure. “This 217-bed project uses locally sourced mass timber, which is a more sustainable choice of building material and demonstrates that smart infrastructure investments can strengthen communities and create lasting benefits.”\n\nThe buildings address a critical shortage of accessible and culturally appropriate student housing in the region, while also helping to reduce pressure on the local rental market. Many North Island College (NIC) students, especially those from rural, Indigenous or low-income backgrounds, faced barriers to attending or completing their education due to a lack of affordable housing in the area.\n\n“I moved three hours from home to the Comox Valley to attend North Island College, a transition that initially brought anxiety about leaving behind my support system and diving into something entirely new,” said Dawson Carter-Woodcock, an NIC student. “From the moment I moved into housing, I felt welcomed and supported. I look forward to calling residence my home for the next two years and to the friendships, personal growth and memories I’ll take with me when I leave.”\n\nConstruction began in September 2023 and the design was developed in partnership with the K’ómoks First Nation and K’ómoks Connections Committee. Named in pentl’ach, one of the languages of the K’ómoks First Nation, the student-housing project is called tul’al’txw, which means “a house (place) of learning.”\n\n“Whether you’re a student on your own or with a family, having the option to live on campus makes it easier for you to succeed in your studies,” said Jessie Sunner, Minister of Post-Secondary Education and Future Skills. “That’s why government is so pleased to support the first student housing on the North Island College Courtenay campus. These family-oriented suites and apartments mean that more people on Vancouver Island can pursue an education and build a better life for their families.”\n\nThe tul’al’txw student-housing complex consists of:\n\ntwo connected buildings, offering 157 beds in studio apartments and shared units; and\n\na third building with 60 beds in two-bedroom suites for students with families.\n\nThe buildings are made of mass timber to reduce environmental impact and support B.C.’s Wood First program. In addition, much of the project was built off site, improving efficiency and minimizing waste. The three buildings meet Step 4 of the B.C. Energy Step Code, the highest energy-efficiency standard for commercial buildings.\n\nThe $77-million complex includes a $75-million investment from the provincial government and a $2-million contribution from North Island College.\n\nSince 2018, government has committed $2 billion to expand on-campus student housing at public post-secondary institutions throughout B.C. To date, approximately 6,900 beds for students are now open, with another 3,900 underway, for a total of 10,800 beds.\n\nLisa Domae, president and CEO, North Island College –\n\n“With the opening of the new housing, tul’al’txw, North Island College marks not only our 50th anniversary but sets us on course for the years ahead. More than simply housing, this place will become central for the people who live here to develop as students and as people, and it helps NIC meet our goal of building healthy and thriving communities, one student at a time.”\n\nToya Mitsuoka, student and student housing assistant, North Island College –\n\n“As a student housing assistant, I’m especially excited to help build a community where every resident feels welcome and supported. Together, we can make this not only the best student housing on the Island, but one of the most vibrant communities in all of B.C. I would like to express my heartfelt gratitude to everyone who made this project possible. Your hard work and dedication have created a space where we can live, grow and thrive.”\n\nQuick Facts:\n\nThe housing complex includes on-site laundry facilities, a multi-faith spiritual practice room, landscaped gardens, a play area and other amenities.\n\nThe two connected student housing buildings are called gukwa’las and tl’emstan. The family housing building is called ʔayɛs kʷ ǰɛǰɛnxʷɛgəs.\n\nLearn More:\n\nFor more information about North Island College, visit: https://www.nic.bc.ca/"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1Rk9SMDAzOS0wMDA5MDc",
    "title_en": "Wood-product manufacturing gets a boost",
    "summary_en": "Nine more forestry companies are being supported to modernize, innovate and diversify their product lines and fibre sources to make more high-value, made-in-B.C. products, and help protect and create jobs.",
    "url": "https://news.gov.bc.ca/releases/2025FOR0039-000907",
    "hero_img": "https://images.unsplash.com/photo-1583432714481-3c1beb1fc131?ixid=M3w4MDYzNzl8MHwxfHNlYXJjaHwxfHxXb29kLXByb2R1Y3QlMjBtYW51ZmFjdHVyaW5nJTIwZ2V0cyUyMEJyaXRpc2glMjBDb2x1bWJpYXxlbnwxfDB8fHwxNzU4MzIyMjY0fDA&ixlib=rb-4.1.0&w=1600&h=900&q=80&auto=format&fit=crop",
    "published_at": "2025-09-18T13:15:00.000Z",
    "content_en": "Nine more forestry companies are being supported to modernize, innovate and diversify their product lines and fibre sources to make more high-value, made-in-B.C. products, and help protect and create jobs.\n\n“It’s no secret our forestry sector is facing many challenges, making these investments timely, while I continue the fight to secure every dollar from Ottawa to support people in B.C.’s forestry sector,” said Ravi Parmar, Minister of Forests. “These companies are vital to their communities and this funding is one way we are working with them to help protect jobs, support local economies and build a sustainable forestry sector for generations to come.”\n\nThrough the BC Manufacturing Jobs Fund (BCMJF), the Province is contributing as much as $2.5 million for nine wood-product manufacturing businesses to plan or complete capital projects. This may include building new or upgrading existing facilities to scale their operations, buying new equipment to help maximize production and fibre utilization, and reduce waste, or conducting planning activities to support future capital investments.\n\nFor example, Canadian Bavarian Millwork and Lumber Ltd. in Chemainus will receive as much as $1.4 million to help build its new facility and buy advanced equipment. These upgrades will boost production capacity and expand the use of fibre to produce new solid and engineered wood products. This expansion is expected to create five to 10 new jobs, and will include training for current staff on state-of-the art, AI-enabled features of new machinery, laying the groundwork for long-term growth and innovation.\n\n“We are honoured to receive support from the BC Manufacturing Jobs Fund, which will help us modernize and expand our operations in Chemainus,” said Georg Woernle, owner, Canadian Bavarian Millwork and Lumber Ltd. “This investment empowers us to enhance production of high-quality millwork and wood products, while creating skilled jobs in our community. With this support, we’re strengthening our commitment to sustainable manufacturing and ensuring our long-term competitiveness in the B.C. forestry sector.”\n\nThe BCMJF has helped drive more than $588 million into forestry-product manufacturing, leading to the direct creation and protection of nearly 3,600 forestry-sector jobs, many in regional, remote and Indigenous communities.\n\n“We’re opening new doors for B.C. forestry products and helping communities thrive with stable, well-paying jobs,” said Ravi Kahlon, Minister of Jobs and Economic Growth. “At a time when unjustified U.S. tariffs are impacting people in B.C., our investment in manufacturing creates more value for every tree harvested, turning challenges into opportunities that help B.C. businesses thrive.”\n\nThe BCMJF has also led to increased production of mass timber, engineered wood and bioproducts, with B.C.-based companies leading the way in innovative uses of waste wood, residuals and available fibre for high-value, high-demand products and exports. The Province has partnered with 74 forestry-product manufacturers, dedicating more than $90.5 million to the industry to move collaboratively toward a stable, sustainable forestry sector in B.C.\n\nRon Sangara, president, Leslie Forest Products Ltd. –\n\n“Funding from the BC Manufacturing Jobs Fund has enabled Leslie Forest Products to invest in advanced technology that increases efficiency, supports sustainability and creates good local jobs. This project ensures our family-run business can continue serving markets around the world, while contributing to B.C.’s economy and communities.”\n\nJeff Popham, president, Island Precision Manufacturing Ltd. –\n\n“We are excited to be upgrading our manufacturing capacity with two new advanced wood-processing machines and the assistance of the BC Manufacturing Jobs Fund. This equipment will allow us to produce more parts to finer tolerances with less downtime – and serve our customers better.”\n\nQuick Facts:\n\nThe BCMJF supports high-value industrial and manufacturing capital projects in all sectors that will create and protect well-paying jobs.\n\nMore than $1.2 billion is being invested in the 153 capital projects funded through the BCMJF, with almost $151.7 million committed from B.C. so far, unlocking more than $1 billion in private-sector and other public investment. Every $1 million invested results in $7 million in total direct capital investments in B.C., $590,000 in tax revenue to the Province and $5.3 million in provincial GDP during capital construction.\n\nEvery $1 million invested results in $7 million in total direct capital investments in B.C., $590,000 in tax revenue to the Province and $5.3 million in provincial GDP during capital construction.\n\nFunded projects will create more than 2,100 jobs and protect more than 2,700 jobs.\n\nLearn More:\n\nTo learn more about the BC Manufacturing Jobs Fund, including a list of recipients, visit: https://gov.bc.ca/ManufacturingJobsFund\n\nA backgrounder follows."
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1QUYwMDE4LTAwMDkwNA",
    "title_en": "Funding helps prepare farms, animals for extreme weather",
    "summary_en": "Farmers in British Columbia will receive support to better protect their farms and animals from extreme weather through the Beneficial Management Practices program.",
    "url": "https://news.gov.bc.ca/releases/2025AF0018-000904",
    "hero_img": "https://images.unsplash.com/photo-1668363013571-bf8a17ee6191?ixid=M3w4MDYzNzl8MHwxfHNlYXJjaHwxfHxGdW5kaW5nJTIwaGVscHMlMjBwcmVwYXJlJTIwQnJpdGlzaCUyMENvbHVtYmlhfGVufDF8MHx8fDE3NTgzMjIyNjR8MA&ixlib=rb-4.1.0&w=1600&h=900&q=80&auto=format&fit=crop",
    "published_at": "2025-09-11T19:43:00.000Z",
    "content_en": "Farmers in British Columbia will receive support to better protect their farms and animals from extreme weather through the Beneficial Management Practices program.\n\n“From wildfires and extreme heat to flooding and cold weather, B.C. farmers and ranchers are constantly working in these challenging conditions,” said Lana Popham, Minister of Agriculture and Food. “Extreme weather calls for planned and determined preparation, and this program helps producers get ready for unexpected periods of harsh weather so they can continue providing the food that we all rely on.”\n\nFunding for Extreme Weather Preparedness projects, including wildfires, floods and extreme heat, are now being supported through the Beneficial Management Practices program. A new category of cold preparedness has been added to help more farmers and ranchers with their resiliency to extreme weather.\n\nExamples of projects include:\n\nprotection against extreme heat and cold for crops and animals;\n\nfarm building retrofits;\n\nFireSmart B.C. farm and ranch assessments;\n\nprotection and storage of feed and other farm inputs; and\n\ncreative solutions for extreme weather events.\n\n“B.C.’s poultry farmers are focused on building resilience to protect both our animals and the food system that families depend on,” said Brad Driediger, president of the B.C. Poultry Association and B.C. Chicken Growers’ Association. “By supporting practical infrastructure improvements, this program helps ensure that producers remain ready to face the impacts from heat domes, cold snaps, floods or wildfire while continuing to supply British Columbians with safe, local food.”\n\nStarting Oct. 8, 2025, B.C. farmers and ranchers will be able to apply for funding on a first-come, first-served basis. As much as $50,000 per applicant is available, and more than 35 projects will be supported during this round of funding. The four types of projects being accepted under the extreme weather preparedness category include wildfire preparedness, flood preparedness, extreme heat and cold preparedness, and creative solutions.\n\n“For over 70 years, three generations of our family have been manually watering each season, in all types of weather conditions,” said Stephanie Wollen, owner, Wollen Sons Ranch. “With support from this program, we now have new automatic waterers and are able to have a fresh water supply to our cattle, even in drought conditions.”\n\nThe Extreme Weather Preparedness category under the Beneficial Management Practices program is delivered by the Investment Agriculture Foundation of B.C. (IAF), with as much as $1.25 million in funding from the Province.\n\n“IAF is proud to continue serving as a trusted partner in delivering programs that support B.C.’s agriculture and food sector,” said Jack Dewit, chair of IAF. “Helping farms and ranches prepare for extreme weather is essential to protecting B.C.’s future food security.”\n\nLearn More:\n\nTo find out more about the Beneficial Management Practices program and Extreme Weather Preparedness category, visit: www.iafbc.ca/bmp/"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1SE1BMDA4MC0wMDA5MDM",
    "title_en": "Nearly 250 rental homes underway in Township of Langley",
    "summary_en": "Construction has started on nearly 250 rental homes in the Township of Langley, helping more people find housing options close to work, school and community services.",
    "url": "https://news.gov.bc.ca/releases/2025HMA0080-000903",
    "hero_img": "https://images.unsplash.com/photo-1601564921647-b446839a013f?ixid=M3w4MDYzNzl8MHwxfHNlYXJjaHwxfHxOZWFybHklMjAyNTAlMjByZW50YWwlMjBCcml0aXNoJTIwQ29sdW1iaWF8ZW58MXwwfHx8MTc1ODMyMjI2M3ww&ixlib=rb-4.1.0&w=1600&h=900&q=80&auto=format&fit=crop",
    "published_at": "2025-09-12T10:15:00.000Z",
    "content_en": "Construction has started on nearly 250 rental homes in the Township of Langley, helping more people find housing options close to work, school and community services.\n\nThe new homes are being built at 20230 72B Ave., next to the Willoughby Firehall, and at 272nd Street and Fraser Highway, within the Aldergrove community. The sites are among the first to break ground through BC Builds’ housing development opportunities, which connect builders to ready-to-go land and municipalities to expedite projects through the permitting process.\n\n“These homes are for the people who keep our communities running – teachers, tradespeople, health-care workers and others, so they have a place to live close to their jobs, communities and loved ones,” said Christine Boyle, Minister of Housing and Municipal Affairs. “We’re working together with municipalities to build homes people need, and we’re doing it faster than ever.”\n\nThrough BC Builds, homes are fast-tracked with projects moving from concept to construction in 12 to 18 months. The groundbreaking of the new sites marks a major milestone in accelerating housing delivery in the province for people with middle incomes.\n\nThe Township of Langley is providing the land for both projects at no cost, and has partnered with the Province, through BC Housing, and the new Township of Langley Housing Trust Society to make these homes a reality.\n\n“The Township of Langley residents have made it clear, housing that meets the needs of working families, seniors and individuals is a top priority,” said Eric Woodward, mayor of Township of Langley. “These projects reflect our commitment to affordability and livability and show how quickly progress can happen with the right partnerships in place.”\n\nReady by fall 2027, the Aldergrove site will provide 128 new rental homes designed to support everyday life. The building will include a rooftop gathering space and ground-floor commercial units that will host a new Aldergrove library and space for non-profit organizations, creating opportunities for connection and community support.\n\nThe Willoughby site will deliver 118 new rental homes anticipated to be open in summer 2027. With a rooftop amenity space, residents will have more opportunities for recreation and community connection. Both buildings will offer easy access to transit, making it simpler to get to work, school or appointments.\n\nThe plan is for 70% of homes to be offered at market rates and the remaining 30% at 20% below market rent. All residents will be income-tested at move-in, with rental rates aligned to local affordability levels.\n\nBC Builds is part of B.C.’s $19-billion housing investment. Since it launched, more than 3,900 homes are underway, bringing more housing options to people with middle incomes in the province.\n\nZack Staples, vice-president for development, and CFO, Caliber Projects –\n\n“At Caliber Communities, we believe housing is more than buildings. It’s about creating communities where people thrive. Partnering with the Township of Langley and BC Builds, these projects show what’s possible when collaboration meets urgency to deliver attainable homes for middle-income households.”\n\nScott Hargrove, chief executive officer, Fraser Valley Regional Library (FVRL) –\n\n“FVRL joins the Township of Langley in welcoming this exciting new chapter in library services. We look forward to working together to build an amazing library to meet the needs of Aldergrove’s current and future residents.”\n\nQuick Facts:\n\nThe Province, through BC Housing, is providing more than $14.5 million in capital funding toward the Willoughby project and nearly $28 million toward the Aldergrove project.\n\nBC Builds is supported by $2 billion in low-cost financing from the B.C. government, a $950-million provincial commitment and $2 billion in federal financing through the Canada Mortgage and Housing Corporation.\n\nThe program accelerates housing by leveraging underused land, cutting red tape and offering low-interest loans to make projects viable in today’s market conditions.\n\nLearn More:\n\nFor more information about BC Builds, visit: https://www.bcbuildshomes.ca/\n\nTo learn how B.C. is working to deliver more homes for people, visit: https://gov.bc.ca/homesforpeople\n\nA map showing the location of all announced provincially funded housing projects in B.C. is available here: https://www.bchousing.org/projects-partners/Building-BC/homes-for-BC\n\nTo learn how BC Housing is helping to build strong, inclusive communities, visit: https://www.bchousing.org/podcast"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1U0RQUjAwMTEtMDAwODk2",
    "title_en": "Workers, communities affected by tariffs will benefit from expanded supports",
    "summary_en": "People adversely affected by tariffs imposed by the United States will benefit from expanded supports through two new initiatives delivered by the Province in partnership with the Government of Canada.",
    "url": "https://news.gov.bc.ca/releases/2025SDPR0011-000896",
    "hero_img": "https://live.staticflickr.com/65535/54796233586_6e2302222c_b.jpg",
    "published_at": "2025-09-19T09:45:00.000Z",
    "content_en": "People adversely affected by tariffs imposed by the United States will benefit from expanded supports through two new initiatives delivered by the Province in partnership with the Government of Canada.\n\nOriginally focused on forestry, the Build Your Own Future (BYOF) program is being expanded to support workers across all industries affected by U.S. President Donald J. Trump’s tariffs. The program offers five-day business bootcamps, with one-on-one coaching and mentorship to help displaced workers transition into entrepreneurship. Participants who complete the program are eligible for a $5,000 grant to help cover startup costs.\n\n“We know that people have been impacted by Trump’s unjust tariffs, so we are taking action to support them,” said Sheila Malcolmson, B.C.’s Minister of Social Development and Poverty Reduction. “Whether it’s supporting new career training or helping communities adapt to changing economic conditions, these new projects are about putting people first. We’re investing in their ideas and their futures.”\n\nFunded through a $2.95-million investment, the BYOF program is delivered by the Northern Innovation Network. The funding supports a three-year initiative to develop and deliver entrepreneurship training tailored to skilled tradespeople and technicians.\n\n“This program has been some of the best training that I’ve ever had,” said Adrian Bealing, a BYOF participant. “Many people I know are affected by mill closures, so to be able to provide a service to your community as an entrepreneur is a no-brainer. This program has opened so many doors for me that I wouldn’t have had without it. It’s been a great way to connect with other tradespeople and businesspeople.”\n\nThe Province is also launching the Rural and Remote Employment Initiatives Fund (RREIF), which is a $5-million investment to support communities in northern and remote regions. Delivered by the Northern Development Initiative Trust (NDIT), RREIF will fund labour-market studies to help communities address the effects of tariffs and respond to local employment needs. RREIF will also fund business advisory services so organizations can diversify and take advantage of emerging opportunities.\n\n“At NDIT, our focus is on building strong, resilient communities across northern B.C., and the Rural and Remote Employment Initiative Fund is a tangible way of achieving that goal,” said Ben Campbell, chief executive officer, NDIT. “We are proud to be a partner supporting local governments with the tools to clearly understand their unique labour dynamics, and ensuring businesses have the resources they need to address both current and emerging economic gaps.\"\n\nRREIF will support local governments and businesses in regions such as the Cariboo-Chilcotin, Prince George, northeastern and northwestern B.C. Phase 1 of RREIF will launch this fall with two funding streams: the Labour Market Research Plans stream, which will help communities in planning for long-term economic resilience; and the Business Advisory Supports stream for professional services, which will help businesses respond to tariff impacts by diversifying and creating jobs.\n\nThese two programs align with broader efforts by the Province, in partnership with the Government of Canada, to provide targeted support for tariffic-affected workers, businesses and communities. These initiatives are funded through the Canada-British Columbia Labour Market Development Agreement.\n\nPatty Hajdu, federal Minister of Employment, Workforce Development and Official Languages –\n\n“When Canadians face challenges, we face them together. By strengthening programs like Build Your Own Future and launching the Rural and Remote Employment Initiatives Fund, we’re helping Canadians navigate the impacts of tariffs and seize new opportunities. This investment is about more than today’s obstacles, it’s about building a resilient future where every Canadian can succeed.”\n\nMary Mytting, executive director, Northern Innovation Network –\n\n“What we consistently hear from Build Your Own Future participants is that receiving the foundational business skills training gives them the confidence to start their own business, as starting a business can feel scary. They learn what to plan for, how to price out jobs and how to budget and market their business. We then take them deeper and work on the soft skills of how to lead their business, customer service and project management, exposing them to ideas and concepts that help make their business sustainable.”\n\nQuick Facts:\n\nThe BYOF curriculum includes skills such as finance, marketing, operations and project management, along with training in health and safety, customer service, leadership and diversity. Programs are offered both in-person and online to ensure accessibility throughout the province.\n\nPrograms are offered both in-person and online to ensure accessibility throughout the province.\n\nFunding intakes for the RRREIF are as follows: Labour Market Research Plans stream: from Oc"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1SE1BMDA3OC0wMDA4ODA",
    "title_en": "B.C. supports literacy for lifelong learning",
    "summary_en": "Children and families throughout B.C. will keep building stronger futures through reading and everyday learning with continued support for literacy programs.",
    "url": "https://news.gov.bc.ca/releases/2025HMA0078-000880",
    "hero_img": "https://images.unsplash.com/photo-1668363013571-bf8a17ee6191?ixid=M3w4MDYzNzl8MHwxfHNlYXJjaHwxfHxCLkMuJTIwc3VwcG9ydHMlMjBsaXRlcmFjeSUyMEJyaXRpc2glMjBDb2x1bWJpYXxlbnwxfDB8fHwxNzU4MzIyMjYzfDA&ixlib=rb-4.1.0&w=1600&h=900&q=80&auto=format&fit=crop",
    "published_at": "2025-09-12T10:15:00.000Z",
    "content_en": "Children and families throughout B.C. will keep building stronger futures through reading and everyday learning with continued support for literacy programs.\n\n“Literacy helps people thrive in every part of life and is the foundation of strong communities,” said Christine Boyle, Minister of Housing and Municipal Affairs. “From reading a bedtime story to filling out a job application, literacy is a powerful tool that supports children’s development and helps all of us connect to opportunity, community and each other.”\n\nContinuing its annual support, the B.C. government is providing $500,000 to the Raise-a-Reader campaign, which supports literacy for young readers and families by increasing awareness and raising money to fund community-based programs throughout B.C. Since 2017, the Province has donated $4.5 million to the campaign.\n\n“Raise-a-Reader is a vital source of family literacy funding across British Columbia, particularly in rural, remote, and northern communities,” said Sandra Lee, executive director, Decoda Literacy Solutions. “It has empowered newcomer families to access child care, sports and after-school programs, supported community gardens that connect literacy with environmental action, and, through a partnership with Poverty Advocacy Nanaimo, created opportunities for children to build confidence and find joy in reading and learning.”\n\nLiteracy is an essential skill that helps people succeed at school and work and feel confident navigating everyday life. Reading sparks curiosity and creativity, and can provide valuable and fun learning opportunities to children through daily routines. Reading together also supports emotional growth and well-being by opening up conversations among children and caregivers, helping build stronger bonds.\n\n“Books BC applauds the Province’s sustained investment in Raise-a-Reader’s mission to ensure literacy programs are accessible by all British Columbians, regardless of age, geographic location or English language ability,” said Matea Kulić, executive director, Association of Book Publishers of BC (Books BC). “Books are a pathway to exploration, increased empathy and lifelong learning. Fostering a love of reading also helps to strengthen B.C.’s publishing industry, which contributes over $57 million to the provincial GDP and sustains hundreds of B.C. jobs.”\n\nThis year, the Raise-a-Reader campaign will run from Friday, Sept. 19 until Friday, Sept. 26. Organized by the Vancouver Sun and delivered in partnership with Decoda Literacy Solutions, the campaign helps fund programs that focus on young readers and families. Donations are used to buy and share reading materials to support further development of reading programs in community organizations, public libraries and schools, as well as host community events focused on awareness and building literacy skills throughout British Columbia.\n\nQuick Facts:\n\nCreated by the Vancouver Sun newspaper in 1997, the Raise-a-Reader fundraising and awareness campaign has generated more than $24 million to support literacy programs in B.C.\n\nThe B.C. government also supports literacy through annual investments: $2.185 million for Decoda Literacy Solutions, $65,000 for the BC Summer Reading Club, $14 million in public library operating funding, and $3.4 million for Community Adult Literacy Programs throughout B.C.\n\nThe B.C. government has provided $56 million for public libraries since 2020 to address growing demand and to ensure libraries can keep providing the services people rely on.\n\nThis funding includes a historic one-time grant of $45 million, issued in 2023, to expand digital collections, improve programming and hours and make libraries more accessible and welcoming.\n\nLearn More:\n\nTo find out more or donate, visit: https://www.raiseareader.com"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1RUNDMDAyNy0wMDA4OTc",
    "title_en": "New child care centre a boost for Creston families",
    "summary_en": "More families in Creston will have access to affordable and high-quality child care as the Province invests in 110 new licensed child care spaces.",
    "url": "https://news.gov.bc.ca/releases/2025ECC0027-000897",
    "hero_img": "https://images.unsplash.com/photo-1694957202541-3f3498a1b146?ixid=M3w4MDYzNzl8MHwxfHNlYXJjaHwxfHxjaGlsZCUyMGNhcmUlMjBjZW50cmUlMjBCcml0aXNoJTIwQ29sdW1iaWF8ZW58MXwwfHx8MTc1ODMyMjI2Mnww&ixlib=rb-4.1.0&w=1600&h=900&q=80&auto=format&fit=crop",
    "published_at": "2025-09-12T11:45:00.000Z",
    "content_en": "More families in Creston will have access to affordable and high-quality child care as the Province invests in 110 new licensed child care spaces.\n\n“With this provincial investment, families in Creston will have access to high-quality child care closer to home,” said Lisa Beare, Minister of Education and Child Care. “These new spaces give parents more flexibility to plan their work and family schedules, while ensuring children have a safe, engaging place to learn and grow.”\n\nConstruction of the new child care centre was made possible by more than $10.8 million in funding through the ChildCareBC New Spaces Fund.\n\n“This project is about helping local families live, work and thrive in our community,” said Arnold DeBoon, mayor of Creston. “We know that access to housing and child care are two of the biggest challenges facing Creston families, and this project tackles both at once. We are deeply grateful to have been selected as a recipient of the ChildCareBC New Spaces Fund.”\n\nThe child care centre will include 36 spaces for infants and toddlers, 50 spaces for children ages three to five and 24 spaces for school-age child care.\n\nSince 2018, ChildCareBC’s space-creation programs have helped fund more than 41,500 new licensed child care spaces in B.C., with more than 26,200 of those spaces now open. Funding the creation of new child care spaces is part of the Province’s ChildCareBC plan to build access to affordable, quality and inclusive child care for families.\n\nRohini Arora, parliamentary secretary for child care –\n\n“This is an exciting moment for Creston. With this investment, more children will have a safe, nurturing place to play and learn, while empowering their parents to focus on their own professional and personal-development goals. These new child care spaces will greatly benefit hard-working families and the whole community for years to come.”\n\nBrittny Anderson, MLA for Kootenay Central –\n\n“I'm grateful that the Province could support the Creston Valley Housing Corporation on its first project, that will provide much-needed housing and child care for the community. Local people know the needs of their communities best, and when the Province can collaborate with community leaders on projects that help to create a brighter future, everyone wins. I want to the thank the CVHC team for the work they do, and I look forward to seeing this project come to fruition!”\n\nLearn More:\n\nFor more information on ChildCareBC, visit: www.gov.bc.ca/childcare\n\nFor more information on the ChildCareBC New Spaces Fund, visit: www.gov.bc.ca/childcare/newspacesfund"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1RUNDMDAyOS0wMDA5MDI",
    "title_en": "New child care centre coming to families in Port Moody",
    "summary_en": "More families in Port Moody will have access to affordable and high-quality child care through 150 new licensed child care spaces at the former Ioco school.",
    "url": "https://news.gov.bc.ca/releases/2025ECC0029-000902",
    "hero_img": "https://images.unsplash.com/photo-1694957202541-3f3498a1b146?ixid=M3w4MDYzNzl8MHwxfHNlYXJjaHwxfHxjaGlsZCUyMGNhcmUlMjBjZW50cmUlMjBCcml0aXNoJTIwQ29sdW1iaWF8ZW58MXwwfHx8MTc1ODMyMjI2Mnww&ixlib=rb-4.1.0&w=1600&h=900&q=80&auto=format&fit=crop",
    "published_at": "2025-09-12T11:45:00.000Z",
    "content_en": "More families in Port Moody will have access to affordable and high-quality child care through 150 new licensed child care spaces at the former Ioco school.\n\n“By working together with School District No. 43 and our federal partners, we are creating more child care spaces in Port Moody that meet the needs of families,” said Lisa Beare, B.C.’s Minister of Education and Child Care. “These new spaces, located on a former school site, will give parents more flexibility to pursue personal goals while knowing their children learn and play in safe environments.”\n\nThe new spaces were made possible by $13.9 million from the ChildCareBC New Spaces Fund. This fund is jointly supported by provincial investments and federal funding under the 2021-22 to 2025-26 Canada-British Columbia Canada-wide Early Learning and Child Care Agreement. British Columbia and the federal government signed an extension to the agreement for 2026-27 until 2030-31.\n\n“Government of Canada investments like these in affordable child care spaces are good for families, good for children and good for Port Moody communities,” said Anna Gainey, Canada’s Secretary of State for Children and Youth. “We’re working with the Government of British Columbia and all partners to ensure that children and families have access to high-quality early learning. When children have the best start in life, families thrive and all Canadians benefit.”\n\nThe new child care centre will include 36 spaces for infants and toddlers, 66 spaces for children ages three to five and 48 spaces for school-age child care.\n\n“School District No. 43 (Coquitlam) is pleased to receive provincial funding to support a new child care centre in Port Moody (Ioco Road),” said Michael Thomas, board chair, SD43. “This child care centre will expand access to safe, affordable, high-quality care for local families. Early learning opportunities help young children build confidence, develop routines and ease the transition into kindergarten. We’re grateful for the continued partnership in creating welcoming, inclusive spaces where children can learn, grow and feel a strong sense of belonging.”\n\nWhen the new facilities are open, families will benefit from affordable child care fees through the Province’s fee-reduction program, which reduces the cost of child care by as much as $900 per child per month.\n\nSince 2018, ChildCareBC’s space-creation programs have helped fund more than 41,500 new licensed child care spaces in B.C., with more than 26,200 of those spaces now open. Funding the creation of new child care spaces is part of the Province’s ChildCareBC plan to build access to affordable, quality and inclusive child care for families.\n\nRohini Arora, B.C. parliamentary secretary for child care –\n\n“Transforming a former school site into new child care spaces are the type of creative solutions that are we pursuing to ensure working families have access to high quality care close to home. Through strong collaboration with our partners, we’re continuing to deliver a record number of spaces across B.C., allowing families to breathe a little easier, empowering parents to return to work and providing safe and reliable spaces for children to learn and grow.”\n\nRick Glumac, MLA, Port-Moody-Burquitlam –\n\n“Long ago, children in Port Moody used this site for learning and now children will use this site again, this time for child care. By working with the Coquitlam School District and federal partners, we’re creating child care spaces close to home for families to access in a seamless way.”\n\nLearn More:\n\nFor more information on ChildCareBC, visit: www.gov.bc.ca/childcare\n\nMore information on the ChildCareBC New Spaces Fund is available at: www.gov.bc.ca/childcare/newspacesfund\n\nFor more information on the Canada-British Columbia Canada-wide Early Learning and Child Care Agreement, visit: https://www.canada.ca/en/early-learning-child-care-agreement/agreements-provinces-territories/british-columbia-canada-wide-2021.html"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1RUNDMDAyOC0wMDA4OTg",
    "title_en": "New child care centre coming for Cranbrook families",
    "summary_en": "More families in Cranbrook will have access to affordable and high-quality child care through 123 new licensed child care spaces.",
    "url": "https://news.gov.bc.ca/releases/2025ECC0028-000898",
    "hero_img": "https://images.unsplash.com/photo-1694957202541-3f3498a1b146?ixid=M3w4MDYzNzl8MHwxfHNlYXJjaHwxfHxjaGlsZCUyMGNhcmUlMjBjZW50cmUlMjBCcml0aXNoJTIwQ29sdW1iaWF8ZW58MXwwfHx8MTc1ODMyMjI2Mnww&ixlib=rb-4.1.0&w=1600&h=900&q=80&auto=format&fit=crop",
    "published_at": "2025-09-12T11:45:00.000Z",
    "content_en": "More families in Cranbrook will have access to affordable and high-quality child care through 123 new licensed child care spaces.\n\n“This is a huge milestone for families in Cranbrook, with the city’s first ChildCare BC New Spaces Fund project,” said Lisa Beare, B.C. Minister of Education and Child Care. “By working with our federal and municipal partners, we’re creating more affordable child care spaces that will empower parents to return to work or school while providing access to high-quality care for their little ones. These investments support families today, while building stronger, more connected communities for the future.”\n\nThe new spaces were made possible by more than $13.5 million through the ChildCareBC New Spaces Fund. This fund is jointly supported by provincial investments and federal funding under the 2021-22 to 2025-26 Canada-British Columbia Canada-wide Early Learning and Child Care Agreement. B.C. and the federal government signed an extension to the agreement for 2026-27 until 2030-31.\n\n“Our government made a commitment to Canadians to establish a nationwide early learning and child care system,” said Anna Gainey, federal Secretary of State for Children and Youth. “We’re delivering on that promise by investing in this new facility to make it a reality to families in and around Cranbrook. These new affordable child care spaces will get parents off the wait lists and ensure children receive the best possible start in life.”\n\nThis new child care centre will include 48 spaces for infant-toddlers and 75 spaces for children 3-5.\n\n“Cranbrook has a very large, unfilled need for all-day child care and more before- and after-school care,” said Wayne Price, mayor of Cranbrook. “We are grateful for the support from the Government of B.C. and Government of Canada to help council and staff move this important initiative forward and to provide meaningful assistance to families in Cranbrook.”\n\nWhen the new facilities are open, families will benefit from affordable child care fees through the Province’s fee-reduction program, which reduces the cost of child care by as much as $900 per child per month.\n\nSince 2018, ChildCareBC’s space-creation programs have helped fund more than 41,500 new licensed child care spaces in B.C., with more than 26,200 of those spaces open. Funding the creation of new child care spaces is part of the Province’s ChildCareBC plan to build access to affordable, quality and inclusive child care for families.\n\nRohini Arora, B.C. parliamentary secretary for child care –\n\n“This announcement is an important milestone for families in Cranbrook. We’re opening doors to more child care options that work for parents and give children a strong start. These new spaces will mean less time worrying about care and more time focusing on the things that matter to working people.”\n\nSteve Morissette, MLA of Kootenay-Monashee –\n\n“This is a proud day for Cranbrook as we welcome the city’s first provincially funded child care project. Rural parents have been asking for more affordable and reliable options close to home and we’re delivering just that. With support from our federal partners, these new spaces will make life easier for families and give their children the chance to learn and grow right here in their community.”\n\nLearn More:\n\nFor more information about ChildCareBC, visit: https://gov.bc.ca/childcare\n\nFor more information about the ChildCareBC New Spaces Fund, visit: https://gov.bc.ca/childcare/newspacesfund\n\nFor more information about the Canada-British Columbia Canada-wide Early Learning and Child Care Agreement, visit: https://www.canada.ca/en/early-learning-child-care-agreement/agreements-provinces-territories/british-columbia-canada-wide-2021.html"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1V0xSUzAwMzktMDAwODk5",
    "title_en": "Public comment period opens for proposed Gwa’ni land-use objectives",
    "summary_en": "The public is invited to comment on proposed ministerial orders to implement the Gwa’ni land-use plan.",
    "url": "https://news.gov.bc.ca/releases/2025WLRS0039-000899",
    "hero_img": "https://images.unsplash.com/photo-1724440550628-84d3fd9f076d?ixid=M3w4MDYzNzl8MHwxfHNlYXJjaHwxfHxjb21tZW50JTIwcGVyaW9kJTIwcHJvcG9zZWQlMjBCcml0aXNoJTIwQ29sdW1iaWF8ZW58MXwwfHx8MTc1ODMyMjI2OXww&ixlib=rb-4.1.0&w=1600&h=900&q=80&auto=format&fit=crop",
    "published_at": "2025-09-18T13:00:00.000Z",
    "content_en": "The public is invited to comment on proposed ministerial orders to implement the Gwa’ni land-use plan.\n\nThe plan, developed in partnership with ‘Na̲mg̲is First Nation, will help protect biodiversity, support ‘Na̲mg̲is First Nation cultural values and provide operational clarity for the forestry industry.\n\nFrom Friday, Sept. 19, 2025, until Nov. 18, 2025, people in British Columbia can share feedback on the proposed ministerial orders that would implement key components of the Gwa’ni Land Use Plan. The Gwa’ni Land Use Plan covers more than 166,000 hectares of Crown land within the Nimpkish River watershed south of Port McNeill. Private property is neither included nor affected by this proposed plan.\n\nCollectively, the proposed land-use direction and its related four ministerial orders would:\n\nclarify forestry planning and operations within territory;\n\nhelp protect biodiversity, ecosystems, culturally important sites and other values identified within the watershed;\n\nsupport a modern, co-ordinated approach to managing natural resources; and\n\nupdate land-use guidelines that reflect a shared vision for caring for the land together.\n\nThe Gwa’ni Land Use Plan will support the local economy by providing planning and operational clarity. The plan aims to create stability for the forestry sector in the area and enable an increase in the average harvest levels of the past seven years in the Nimpkish River watershed within ‘Na̲mg̲is territory, as well as support work underway on the Tree Farm Licence 37 Forest Landscape Plan.\n\nLand-use planning on northern Vancouver Island was co-developed between the Province and ‘Na̲mg̲is First Nation and included direct engagement with the people in the region, local government, industry and stakeholders.\n\nThe proposed ministerial orders maintain public access for recreation, hunting and other activities. By seeking input from the public and working with communities, land-use planning is meant to help identify areas for conservation and recreation.\n\nIn compliance with a statutory requirement, the Province has published a notice of the open 60-day consultation in a local newspaper and the B.C. Gazette.\n\nLearn More:\n\nTo view and comment about the proposed ministerial orders, visit: https://www.planninginpartnership.ca/p/6038070ec65ea900200bbf5a/documents;currentPage=1;pageSize=100;sortBy=-dateAdded;ms=1757970050496\n\nTo learn about the Gwa’ni Land Use Planning Project, visit: https://www.planninginpartnership.ca/api/document/68c09c01da4bd20021d40b6e/fetch/46009_Attachment_5_-_Gwa%27ni_Project_Plan_Summary.pdf\n\nTo see the notice in B.C. Gazette, visit Part 1 online: https://www.crownpub.bc.ca/home/gazette"
  },
  {
    "id": "aHR0cHM6Ly9uZXdzLmdvdi5iYy5jYS9yZWxlYXNlcy8yMDI1TEJSMDAzOC0wMDA5MDU",
    "title_en": "Minister’s statement on the Cowichan Valley Transit dispute",
    "summary_en": "Jennifer Whiteside, Minister of Labour, has issued the following statement on the Cowichan Valley Transit System labour dispute:",
    "url": "https://news.gov.bc.ca/releases/2025LBR0038-000905",
    "hero_img": "https://images.unsplash.com/photo-1723564287621-d07f41562a98?ixid=M3w4MDYzNzl8MHwxfHNlYXJjaHwxfHxNaW5pc3RlciVFMiU4MCU5OXMlMjBDb3dpY2hhbiUyMFZhbGxleSUyMEJyaXRpc2glMjBDb2x1bWJpYXxlbnwxfDB8fHwxNzU4MzIyMjY3fDA&ixlib=rb-4.1.0&w=1600&h=900&q=80&auto=format&fit=crop",
    "published_at": "2025-09-01T07:30:00.000Z",
    "content_en": "Jennifer Whiteside, Minister of Labour, has issued the following statement on the Cowichan Valley Transit System labour dispute:\n\n“I am pleased that the unions, Unifor Locals 114 and 333, and employer, Transdev, have come together and agreed to submit proposals to special mediator Vince Ready, who will issue binding recommendations on all remaining matters.\n\n“I would like to thank Mr. Ready for his ongoing work on this complex dispute, and the parties for their immediate work together on a return-to-work plan. I understand there is time that is required to ensure the buses are road-ready, as part of the process of resuming full services to the residents of the Cowichan Valley as soon as possible.\n\n“This is welcome news for residents who rely on transit services in the Cowichan Valley. The service disruption has been deeply disruptive to people living in the region, and this has been a very difficult period for many.\n\n“In the coming days, BC Transit will provide more information on its plan to resume service for the community.”"
  }
]
